Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/СтудентыОО/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	Если ЭтоПолныйИнтерфейс Тогда
		Элементы.ПровестиОбучение.Видимость = Ложь;
		Элементы.ПосмотретьРезультаты.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.УчебнаяГруппа) Тогда
		УчебнаяГруппа = Параметры.УчебнаяГруппа;
		Элементы.УчебнаяГруппа.Видимость = Ложь;
	КонецЕсли;
	Если Параметры.СкрытьЭлементыУправления Тогда
		Элементы.ГруппаОтбор.Видимость = Ложь;
		Элементы.Список.ТолькоПросмотр = Истина;		
		Элементы.ФормаСоздать.Видимость = Ложь;
		Элементы.ФормаИзменить.Видимость = Ложь;
		Элементы.ФормаУдалить.Видимость = Ложь;
		Элементы.ФормаОбработкаИмпортСтудентовООИмпортСтудентов.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СпециальностьОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КурсОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УчебнаяГруппаОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтделениеОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ФормаОбученияОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СпециализацияОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтборПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПровестиОбучение(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеПродолжение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиОбучениеПродолжение(ВыбранныйЭлектронныйРесурс, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлектронныйРесурс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСтудентовДляНазначения = ПолучитьКоличествоВыбранныхСтудентов();
	
	ТекстВопроса = НСтр("ru = 'Провести новое обучение ""%2"" %1 студентов?'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КоличествоСтудентовДляНазначения), ВыбранныйЭлектронныйРесурс);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПровестиОбучениеОбработкаВопроса", ЭтотОбъект, ВыбранныйЭлектронныйРесурс);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПровестиОбучениеОбработкаВопроса(Ответ, ВыбранныйЭлектронныйРесурс) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли; 
	
	ПроведениеОбучения = НазначитьСтудентовНаОбучение(ВыбранныйЭлектронныйРесурс);
	
	Если ЗначениеЗаполнено(ПроведениеОбучения) Тогда
		ПоказатьЗначение(,ПроведениеОбучения);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПосмотретьРезультаты(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПосмотретьРезультатыПродолжение", ЭтотОбъект);				
	
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора", Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Истина),,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьРезультатыПродолжение(МассивЭлектронныхКурсов, ДополнительныеПараметры) Экспорт
	
	Если МассивЭлектронныхКурсов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МассивЭлектронныхКурсов = Новый ФиксированныйМассив(МассивЭлектронныхКурсов);
	
	МассивСтудентов = ПолучитьВыбранныхСтудентов();	
	
	ОткрытьФорму("ОбщаяФорма.СводнаяВедомостьСУО", Новый Структура("МассивПользователей, МассивЭлектронныхРесурсов", МассивСтудентов, МассивЭлектронныхКурсов));		
	
КонецПроцедуры	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	Если ЗначениеЗаполнено(Курс) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Курс", Курс);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Курс");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "УчебнаяГруппа", УчебнаяГруппа);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "УчебнаяГруппа");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", Статус);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Статус");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специализация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Специализация", Специализация);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Специализация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специальность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Специальность", Специальность);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Специальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаОбучения) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ФормаОбучения", ФормаОбучения);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ФормаОбучения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", Статус);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Статус");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция НазначитьСтудентовНаОбучение(ЭлектронныйРесурс)
	
	НачатьТранзакцию();
	
	ПроведениеОбученияОбъект = Документы.ПроведениеОбученияСУО.СоздатьДокумент();
	ПроведениеОбученияОбъект.Дата                        = ТекущаяДата();
	ПроведениеОбученияОбъект.Статус                      = Перечисления.СтатусыПроведенияОбъектовСУО.Активно;	
	ПроведениеОбученияОбъект.ЭлектронныйРесурс           = ЭлектронныйРесурс;
	ПроведениеОбученияОбъект.НаОсновеЭлектронногоРесурса = Истина;
	
	ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Оперативный);
	
	ВыборкаСтудентов = ПолучитьВыбранныхСтудентов();
	
	Для каждого Студент Из ВыборкаСтудентов Цикл
		УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ПроведениеОбученияОбъект.Ссылка,, Студент);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат ПроведениеОбученияОбъект.Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьВыбранныхСтудентов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних ГДЕ %1";

	Подстановка = "";
	
	Если ЗначениеЗаполнено(Курс) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.Курс = &Курс И";
		
		Запрос.УстановитьПараметр("Курс", Курс);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.УчебнаяГруппа = &УчебнаяГруппа И";
		
		Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.Статус = &Статус И";
		
		Запрос.УстановитьПараметр("Статус", Статус);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специализация) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.Специализация = &Специализация И";
		
		Запрос.УстановитьПараметр("Специализация", Специализация);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специальность) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.Специальность = &Специальность И";
		
		Запрос.УстановитьПараметр("Специальность", Специальность);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаОбучения) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.ФормаОбучения = &ФормаОбучения И";
		
		Запрос.УстановитьПараметр("ФормаОбучения", ФормаОбучения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отделение) Тогда
		
		Подстановка = Подстановка + " СтудентыООСрезПоследних.Отделение = &Отделение И";
		
		Запрос.УстановитьПараметр("Отделение", Отделение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подстановка) Тогда
		Подстановка = Сред(Подстановка, 1, СтрДлина(Подстановка)-1); // Убираем последнюю "И"	
	КонецЕсли;

	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, Подстановка);
	
	Результат = Запрос.Выполнить();

	ТаблицаРезультата = Результат.Выгрузить();
	
	Возврат Новый ФиксированныйМассив(ТаблицаРезультата.ВыгрузитьКолонку("Пользователь"));  
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВыбранныхСтудентов()
	
	ВыборкаСтудентов = ПолучитьВыбранныхСтудентов();
	
	Возврат ВыборкаСтудентов.Количество();	
	
КонецФункции


#КонецОбласти
